app/Controllers/Index.php

SELECT *
FROM `uls_user_creation`
WHERE `user_name` = ('adani_admin')
AND `password` = ('welcome')
 LIMIT 1
UPDATE `uls_user_creation` SET `last_login_date` = '2024-08-02 09:42:10', `modified_date` = '2024-08-02 09:42:10'
WHERE `user_id` = '31'
---
	public function logininsert()
	{
		if($this->request->getPost('username')){

			$data_user=array('username'=>trim($this->request->getPost('username')),'password'=>trim($this->request->getPost('password')));
			if(!empty($data_user['username']) && !empty($data_user['password'])){

				$user=new UlsUserCreation();
				$data=$user->where("user_name",[$data_user['username']]);
				$data=$user->where("password",[$data_user['password']]);
				$data=$user->first();
				// echo "<pre>";
				// print_r($data['user_id']);
				// exit();
				//$data=Doctrine_Core::getTable('UlsUserCreation')->findOneByUser_nameAndPassword($data['username'],$data['password']);

				if(isset($data['user_id'])){
					if($data['start_date']<=date("Y-m-d") && (empty($data['end_date']) || $data['end_date']=="0000-00-00" || $data['end_date']=="1970-01-01"|| $data['end_date']>=date("Y-m-d"))){
						$userupdate=new UlsUserCreation();
						$dataupdate=$userupdate->set("last_login_date",date("Y-m-d H:i:s"));
						$dataupdate=$userupdate->where("user_id",$data['user_id']);
						$dataupdate=$userupdate->update();